

من userbot استيراد CMD_HELP
من أحداث الاستيراد telethon
استيراد asyncio
من userbot.utils استيراد admin_cmd
من userbot استيراد ALIVE_NAME
استيراد عشوائي ، إعادة
من مجموعات استيراد deque
DEFAULTUSER = str (ALIVE_NAME) إذا كان ALIVE_NAME آخر "قطة"

@ borg.on (admin_cmd (pattern = r "star $" ، الصادرة = True))
غير متزامن def _ (حدث):
	إذا event.fwd_from:
		إرجاع
	deq = deque (list ("🦋✨🦋✨🦋✨🦋✨"))
	لـ _ في النطاق (48):
		انتظر asyncio.sleep (0.1)
		انتظار الحدث. تحرير ("". انضم (deq))
		ديق.روت (1)
		
@ borg.on (admin_cmd (pattern = r "boxs"))
غير متزامن def _ (حدث):
	إذا event.fwd_from:
		إرجاع
	deq = deque (list ("🟥🟧🟨🟩🟦🟪🟫⬛⬜"))
	لـ _ في النطاق (999):
		انتظر asyncio.sleep (0.1)
		انتظار الحدث. تحرير ("". انضم (deq))
		ديق.روت (1)
		
@ borg.on (admin_cmd (pattern = f "rain $" ، الصادر = True))
غير متزامن def _ (حدث):
	إذا event.fwd_from:
		إرجاع
	deq = deque (list ("🌬☁️🌩🌨🌧🌦🌥⛅🌤"))
	لـ _ في النطاق (48):
		انتظر asyncio.sleep (0.1)
		انتظار الحدث. تحرير ("". انضم (deq))
		ديق.روت (1)
		
@ borg.on (admin_cmd (pattern = r "publish $"))
غير متزامن def _ (حدث):
    إذا event.fwd_from:
        إرجاع
    Animation_interval = 3
    Animation_ttl = النطاق (0 ، 12)
    await event.edit ("جارٍ النشر ...")
    anim_chars = [
        
            "** Heroku Connecting to Latest Github Build **" ،
            f "** بدأ الإنشاء بواسطة المستخدم ** ** {DEFAULTUSER} **" ،
            f "** Deploy **` 535a74f0` ** بواسطة المستخدم ** ** {DEFAULTUSER} ** "،
            "** إعادة تشغيل خادم Heroku ... **" ،
            "** تم تغيير الحالة من ما يصل إلى بداية **" ،    
            "** إيقاف جميع العمليات باستخدام SIGTERM **" ،
            "** تم إنهاء العملية مع **` الحالة 143` "،
            "** بدء العملية بالأمر **` python3 -m stdborg` "،
            "** تم تغيير الحالة من البداية إلى الأعلى ** ،
            "__INFO: Userbot: تم تسجيل الدخول باسم 557667062__" ،
            "__INFO: Userbot: تم تحميل كافة المكونات الإضافية بنجاح__" ،
            "** نجح البناء **"
 ]
    لأني في Animation_ttl:
            انتظر asyncio.sleep (animation_interval)
            في انتظار الحدث. تعديل (animation_chars [i٪ 12])       


@ borg.on (admin_cmd (pattern = "dump؟ (. *)"))
غير متزامن def _ (رسالة):
    محاولة:
        obj = message.pattern_match.group (1)
        إذا كان len (obj)! = 3:
            رفع مؤشر خطأ
        inp = ". الانضمام (obj) 
    باستثناء خطأ الفهرس:
        inp = "🥞 🎂 🍫"
    u، t، g، o، s، n = inp.split ()،  🗑 ،  <(^ _ ^ <) ،  (> ^ _ ^)> ،   ،  \ n 
    h = [(u [0]، u [1]، u [2])، (u [0]، u [1]،   )، (u [0]،   ،   )]
    لشيء معكوس ([y for y in ([".join (x) لـ x in (
    f + (s ، g ، s + s * f.count (  ) ، t) ، f + (g ، s * 2 + s * f.count (  ) ، t) ،
    f [: i] + (o ، f [i] ، s * 2 + s * f.count (  ) ، t) ، f [: i] + (s + s * f.count (  ) ، س ، و [i] ، ق ، ر) ،
    f [: i] + (s * 2 + s * f.count (  ) ، o ، f [i] ، t) ، f [: i] + (s * 3 + s * f.count (   ) ، س ، ر) ،
    f [: i] + (s * 3 + s * f.count (  )، g، t))] لـ i، f في التعداد (معكوس (ح)))]):
        لشيء آخر في شيء ما:
            انتظر asyncio.sleep (0.3)
            محاولة:
                في انتظار الرسالة.
            باستثناء الأخطاء.
                إرجاع
	
@ borg.on (admin_cmd (pattern = "fleaveme $"))
غير متزامن def _ (حدث):
    anim_interval = 1
    Animation_ttl = النطاق (0 ، 10)
    anim_chars = [
        
            "⬛⬛⬛ \ n⬛⬛⬛ \ n⬛⬛⬛"،
            "⬛⬛⬛ \ n⬛🔄⬛ \ n⬛⬛⬛"،
            "⬛⬆️⬛ \ n⬛🔄⬛ \ n⬛⬛⬛"،
            "⬛⬆️↗️ \ n⬛🔄⬛ \ n⬛⬛⬛"،
            "⬛⬆️↗️ \ n⬛🔄➡️ \ n⬛⬛⬛"،    
            "⬛⬆️↗️ \ n⬛🔄➡️ \ n⬛⬛↘️"،
            "⬛⬆️↗️ \ n⬛🔄➡️ \ n⬛⬇️↘️"،
            "⬛⬆️↗️ \ n⬛🔄➡️ \ n↙️⬇️↘️"،
            "⬛⬆️↗️ \ n⬅️🔄➡️ \ n↙️⬇️↘️"،
            "↖️⬆️↗️ \ n⬅️🔄➡️ \ n↙️⬇️↘️"
 ]
    إذا event.fwd_from:
        إرجاع
    انتظار الحدث. تحرير ("fleaveme ....")
    انتظر asyncio.sleep (2)
    لأني في Animation_ttl:
            انتظر asyncio.sleep (animation_interval)
            في انتظار الحدث. تحرير (animation_chars [i٪ 10])
		
@ borg.on (admin_cmd (pattern = "loveu" ، الصادرة = True))
غير متزامن def _ (حدث):
    إذا event.fwd_from:
        إرجاع
    anim_interval = 0.5
    Animation_ttl = النطاق (0 ، 70)
    انتظار الحدث. عدل ("loveu")
    anim_chars = [
            "😀"،
            "👩‍🎨"،
            "😁"،    
            "😂"،
            "🤣"،
            "😃"،
            "😄"،
            "😅"،
            "😊"،
            "☺"،
            "🙂"،    
            "🤔"،
            "🤨"،
            "😐"،
            "😑"،
            "😶"،
            "😣"،
            "😥"،
            "😮"،    
            "🤐"،
            "😯"،
            "😴"،
            "😔"،
            "😕"،
            "☹"،
            "🙁"،
            "😖"،    
            "😞"،
            "😟"،
            "😢"،
            "😭"،
            "🤯"،
            "💔"،
            "❤"،
               
        ]
    لأني في Animation_ttl:
            انتظر asyncio.sleep (animation_interval)
            في انتظار الحدث. تحرير (animation_chars [i٪ 35])
            
@ borg.on (admin_cmd (النمط = f "الطائرة" ، الصادر = صحيح))
غير متزامن def _ (حدث):
    إذا event.fwd_from:
        retun
    في انتظار الحدث. تحرير ("✈ -------------")
    انتظار الحدث. تحرير ("- ✈ ------------")
    انتظار الحدث. تحرير ("- ✈ -----------")
    انتظار الحدث. تحرير ("--- ✈ ----------")
    انتظار الحدث. تحرير ("---- ✈ ---------")
    انتظار الحدث. تحرير ("----- ✈ --------")
    انتظار الحدث. تحرير ("------ ✈ -------")
    انتظار الحدث. تحرير ("------- ✈ ------")
    انتظار الحدث. تحرير ("-------- ✈ -----") 
    انتظار الحدث. تحرير ("--------- ✈ ----")
    انتظار الحدث. تحرير ("---------- ✈ ---")
    انتظار الحدث. تحرير ("----------- ✈--")
    في انتظار الحدث. تحرير ("------------ ✈-")
    في انتظار الحدث. تحرير ("------------- ✈")
    انتظر asyncio.sleep (3)
    انتظار الحدث. حذف ()           
    
    
@ borg.on (admin_cmd (pattern = r "police"))
غير متزامن def _ (حدث):
    إذا event.fwd_from:
        إرجاع
    anim_interval = 0.3
    Animation_ttl = النطاق (0 ، 12)
    في انتظار الحدث. تحرير ("الشرطة")
    anim_chars = [
        
            "🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵"،
            "🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴"،
            "🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵"،
            "🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴"،
            "🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵"،    
            "🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴"،
            "🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵"،
            "🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴"،
            "🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵"،
            "🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴 \ n🔵🔵🔵⬜⬜⬜🔴🔴🔴"،
            "🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵 \ n🔴🔴🔴⬜⬜⬜🔵🔵🔵"،
            f "** Police iz Here **"

 ]
    لأني في Animation_ttl:
        انتظر asyncio.sleep (animation_interval)
        في انتظار الحدث. تعديل (animation_chars [i٪ 12])    

	
@ borg.on (admin_cmd (pattern = f "jio $" ، الصادرة = True))
غير متزامن def _ (حدث):
    إذا event.fwd_from:
        إرجاع
    anim_interval = 1
    Animation_ttl = النطاق (0 ، 19)
    في انتظار event.edit ("تعزيز شبكة jio ...")
    anim_chars = [
            "الاتصال بشبكة JIO NETWORK ...." ،
            "` █ ▇ ▆ ▅ ▄ ▂ `" ،
            "` ▒ ▇ ▆ ▅ ▄ ▂ `" ،
            "` ▒ ▒ ▆ ▅ ▄ ▂ `" ،
            "` ▒ ▒ ▒ ▅ ▄ ▂ `" ،    
            "` ▒ ▒ ▒ ▒ ▄ ▂ `" ،
            "` ▒ ▒ ▒ ▒ ▒ ▂ `" ،
            "` ▒ ▒ ▒ ▒ ▒ ▒ `" ،
            "` ▒ ▒ ▒ ▒ ▒ ▒ ▒` "،
            "* تحسين شبكة JIO ... *" ،
            "` ▒ ▒ ▒ ▒ ▒ ▒ ▒` "،
            "` ▒ ▒ ▒ ▒ ▒ ▒` "،           
            "` ▂ ▒ ▒ ▒ ▒ ▒` "،
            "` ▂ ▄ ▒ ▒ ▒ ▒` "،
            "` ▂ ▄ ▅ ▒ ▒ ▒` "،
            "` ▂ ▄ ▅ ▆ ▒ ▒` "،
            "` ▂ ▄ ▅ ▆ ▇ ▒` "،
            "` ▂ ▄ ▅ ▆ ▇ █` "،
            "** JIO NETWORK Boosted .... **"
 ]
    لأني في Animation_ttl:
            انتظر asyncio.sleep (animation_interval)
            انتظار الحدث. تحرير (animation_chars [i٪ 19])                
                    
            
@ borg.on (admin_cmd (pattern = f "solarsystem" ، الصادرة = True))
غير متزامن def _ (حدث):
    إذا event.fwd_from:
        إرجاع
    anim_interval = 0.1
    Animation_ttl = النطاق (0 ، 80)
    في انتظار event.edit ("solarsystem")
    anim_chars = [
            "` ◼️◼️◼️◼️◼️ \ n◼️◼️◼️◼️☀ \ n◼️◼️🌎◼️◼️ \ n🌕◼️◼️◼️◼️ \ n◼️◼️◼️◼️◼️` "،
            "` ◼️◼️◼️◼️◼️ \ n🌕◼️◼️◼️◼️ \ n◼️◼️🌎◼️◼️ \ n◼️◼️◼️◼️☀ \ n◼️◼️◼️◼️◼️` "،
            "` ◼️🌕◼️◼️◼️ \ n◼️◼️◼️◼️◼️ \ n◼️◼️🌎◼️◼️ \ n◼️◼️◼️◼️◼️ \ n◼️◼️◼️☀◼️` "،
            "` ◼️◼️◼️🌕◼️ \ n◼️◼️◼️◼️◼️ \ n◼️◼️🌎◼️◼️ \ n◼️◼️◼️◼️◼️ \ n◼️☀◼️◼️◼️` "،
            "` ◼️◼️◼️◼️◼️ \ n◼️◼️◼️◼️🌕 \ n◼️◼️🌎◼️◼️ \ n☀◼️◼️◼️◼️ \ n◼️◼️◼️◼️◼️` "،    
            "` ◼️◼️◼️◼️◼️ \ n☀◼️◼️◼️◼️ \ n◼️◼️🌎◼️◼️ \ n◼️◼️◼️◼️🌕 \ n◼️◼️◼️◼️◼️` "،
            "` ◼️☀◼️◼️◼️ \ n◼️◼️◼️◼️◼️ \ n◼️◼️🌎◼️◼️ \ n◼️◼️◼️◼️◼️ \ n◼️◼️◼️🌕◼️` "،
            "` ◼️◼️◼️☀◼️ \ n◼️◼️◼️◼️◼️ \ n◼️◼️🌎◼️◼️ \ n◼️◼️◼️◼️◼️ \ n◼️🌕◼️◼️◼️` "،
            ]
    لأني في Animation_ttl:
            انتظر asyncio.sleep (animation_interval)
            انتظار الحدث. تحرير (animation_chars [i٪ 8])      
