أوامر تحديث ملف التعريف ""
.pbio <Bio>
.pname <Name>
.ppic "" "
استيراد  نظام التشغيل
من  أحداث الاستيراد telethon  
من  telethon . وظائف استيراد TL  
من  uniborg . استخدام  استيراد  admin_cmd


@ بورج . على ( admin_cmd ( pattern = "pbio (. *)" ))   # pylint: تعطيل = E0602
غير متزامن  def  _ ( حدث ):
    إذا  حدث . fwd_from :
        إرجاع
    bio  =  حدث . تطابق_نمط . مجموعة ( 1 )
    جرب :
        في انتظار  borg ( وظائف . حساب . UpdateProfileRequest (   # pylint: تعطيل = E0602
            حول = bio
        ))
        انتظر  الحدث . تحرير ( "نجحت في تغيير السيرة الذاتية لملفي الشخصي" )
    باستثناء  استثناء  مثل  e :   # pylint: disable = C0103 ، W0703
        انتظر  الحدث . تحرير ( شارع ( هـ ))


@ بورج . على ( admin_cmd ( pattern = "pname ((. | \ n ) *)" ))   # pylint: تعطيل = E0602، W0703
غير متزامن  def _ ( حدث ):
    لو حدث . fwd_from :
        إرجاع
    أسماء  =  حدث . تطابق_نمط . مجموعة ( 1 )
    الاسم الأول  =  الأسماء
    الكنية  =  ""
    إذا كان   " \\ n"  في  الأسماء :
        first_name ، last_name  =  names . انقسام ( " \\ n" ، 1 )
    جرب :
        في انتظار  برج ( وظائف . حساب .UpdateProfileRequest (   # pylint: تعطيل = E0602
            الاسم الأول = first_name ،
            الكنية = last_name
        ))
        انتظر  الحدث . تعديل ( "تم تغيير اسمي بنجاح" )
    يستثنى  استثناء  كما  ه :   # pylint: disable = C0103 ، W0703
        انتظر  الحدث . تحرير ( شارع ( هـ ))


@ بورج . على ( admin_cmd ( نمط = "ppic" ))   # pylint: تعطيل = E0602
غير متزامن  def  _ ( حدث ):
    إذا  حدث . fwd_from :
        إرجاع
    reply_message  =  انتظار  الحدث . get_reply_message ()
    انتظر  الحدث . تحرير ( "تحميل صورة الملف الشخصي على بلدي المحلي ..." )
    إن  لم يكن  نظام التشغيل . المسار . isdir ( التكوين . TMP_DOWNLOAD_DIRECTORY ):   # pylint: تعطيل = E0602
        نظام التشغيل . makedirs ( التكوين . TMP_DOWNLOAD_DIRECTORY )   # pylint: تعطيل = E0602
    الصورة  =  لا شيء
    جرب :
        الصورة  =  انتظر  برج . download_media (   # pylint: تعطيل = E0602
            reply_message ،
            التكوين . TMP_DOWNLOAD_DIRECTORY   # pylint: تعطيل = E0602
        )
    باستثناء  استثناء  مثل  e :   # pylint: disable = C0103 ، W0703
        انتظر  الحدث . تحرير ( شارع ( هـ ))
    آخر :
        إذا  الصورة :
            انتظر  الحدث . تحرير ( "الآن ، تحميل إلى @ Telegram ..." )
            ملف  =  انتظار  برج . upload_file ( الصورة )   # pylint: تعطيل = E0602
            محاولة :
                في انتظار  برج ( وظائف . صور . UploadProfilePhotoRequest (   # pylint: تعطيل = E0602
                    ملف
                ))
            باستثناء  استثناء  مثل  e :   # pylint: disable = C0103 ، W0703
                انتظر  الحدث . تحرير ( شارع ( هـ ))
            آخر :
                انتظر  الحدث . تحرير ( "تم تغيير صورة ملفي الشخصي بنجاح" )
    محاولة :
        نظام التشغيل . إزالة ( الصورة )
    باستثناء  استثناء  مثل  e :   # pylint: disable = C0103 ، W0703
        المسجل . warn ( str ( e ))   # pylint: تعطيل = E0602
